package HomeWork6;

public class TextForFiles {

    public static final String TEXT1 = "File1\n" +
            "Геттер – это особая функция, привязанная к свойству, после которого упоминается. То есть сколько в классе свойств, столько и геттеров.\n" +
            "В теле данной функции описывается, что надо сделать со значением поля, прежде чем его вернуть.\n" +
            "Если достаточно просто вернуть значение как оно есть, то явно get() можно не писать, таким он создается автоматически, чем мы и пользовались в предыдущих уроках.\n" +
            "\n" +
            "В теле get() используется не само имя поля, оно заменяется на ключевое слово field.\n" +
            "Это необходимо, чтобы избежать рекурсивных вызовов get(), то есть когда из тела функции вызывается эта же функция, из нее опять она же и так далее.\n" +
            "Если мы будем использовать собственное имя поля в теле get(), получится что запрашиваем значение этого поля, а значит снова вызываем get().";

    public static final String TEXT2 = "File2\n" +
            "Кроме геттера каждое поле имеет сеттер (setter) – метод set().\n" +
            "Он вызывается, когда свойству присваивается новое значение. Например, a.number = 34.\n" +
            "\n" +
            "В простейшем случае, который работает по умолчанию, то есть когда сеттер можно явно не писать, он выглядит так:\n" +
            "\n" +
            "var number = 0\n" +
            "set(value) {\n" +
            "    field = value\n" +
            "}\n" +
            "\n" +
            "Здесь value – параметр функции set(). Вместо value можно использовать любое другое имя переменной.\n" +
            "Данному параметру присваивается значение, которое мы хотим присвоить свойству.\n" +
            "Например, когда выполняется выражение a.number = 34, то value присваивается 34. В теле set() значение присваивается полю.\n" +
            "При этом вместо его настоящего имени (в данном случае number) используется ключевое слово field по тем же причинам, что и в случае геттера.\n" +
            "\n" +
            "Зачем нужен сеттер? Бывает перед присвоением свойству надо обработать, видоизменить переданное значение.";
}
